name: "BinaryMask"
layer {
  name: "hdf5_train_data"
  type: "HDF5Data"
  top: "data"
  top: "groundtruth"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "train_random/train.txt"
    batch_size: 32
    shuffle: 1
  }
}
layer {
  name: "hdf5_test_data"
  type: "HDF5Data"
  top: "data"
  top: "groundtruth"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "test_random/test.txt"
    batch_size: 32
    shuffle: 1
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_4"
  type: "Convolution"
  bottom: "data"
  top: "conv1_4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_5"
  type: "Convolution"
  bottom: "data"
  top: "conv1_5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_6"
  type: "Convolution"
  bottom: "data"
  top: "conv1_6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_7"
  type: "Convolution"
  bottom: "data"
  top: "conv1_7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_8"
  type: "Convolution"
  bottom: "data"
  top: "conv1_8"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_9"
  type: "Convolution"
  bottom: "data"
  top: "conv1_9"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_10"
  type: "Convolution"
  bottom: "data"
  top: "conv1_10"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_11"
  type: "Convolution"
  bottom: "data"
  top: "conv1_11"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_12"
  type: "Convolution"
  bottom: "data"
  top: "conv1_12"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_13"
  type: "Convolution"
  bottom: "data"
  top: "conv1_13"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_14"
  type: "Convolution"
  bottom: "data"
  top: "conv1_14"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_15"
  type: "Convolution"
  bottom: "data"
  top: "conv1_15"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_16"
  type: "Convolution"
  bottom: "data"
  top: "conv1_16"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_17"
  type: "Convolution"
  bottom: "data"
  top: "conv1_17"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_18"
  type: "Convolution"
  bottom: "data"
  top: "conv1_18"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_19"
  type: "Convolution"
  bottom: "data"
  top: "conv1_19"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_20"
  type: "Convolution"
  bottom: "data"
  top: "conv1_20"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_21"
  type: "Convolution"
  bottom: "data"
  top: "conv1_21"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_22"
  type: "Convolution"
  bottom: "data"
  top: "conv1_22"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_23"
  type: "Convolution"
  bottom: "data"
  top: "conv1_23"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_24"
  type: "Convolution"
  bottom: "data"
  top: "conv1_24"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_25"
  type: "Convolution"
  bottom: "data"
  top: "conv1_25"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_26"
  type: "Convolution"
  bottom: "data"
  top: "conv1_26"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_27"
  type: "Convolution"
  bottom: "data"
  top: "conv1_27"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_28"
  type: "Convolution"
  bottom: "data"
  top: "conv1_28"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_29"
  type: "Convolution"
  bottom: "data"
  top: "conv1_29"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_30"
  type: "Convolution"
  bottom: "data"
  top: "conv1_30"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_31"
  type: "Convolution"
  bottom: "data"
  top: "conv1_31"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_32"
  type: "Convolution"
  bottom: "data"
  top: "conv1_32"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_33"
  type: "Convolution"
  bottom: "data"
  top: "conv1_33"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_34"
  type: "Convolution"
  bottom: "data"
  top: "conv1_34"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_35"
  type: "Convolution"
  bottom: "data"
  top: "conv1_35"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_36"
  type: "Convolution"
  bottom: "data"
  top: "conv1_36"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_37"
  type: "Convolution"
  bottom: "data"
  top: "conv1_37"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_38"
  type: "Convolution"
  bottom: "data"
  top: "conv1_38"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_39"
  type: "Convolution"
  bottom: "data"
  top: "conv1_39"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_40"
  type: "Convolution"
  bottom: "data"
  top: "conv1_40"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_41"
  type: "Convolution"
  bottom: "data"
  top: "conv1_41"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_42"
  type: "Convolution"
  bottom: "data"
  top: "conv1_42"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_43"
  type: "Convolution"
  bottom: "data"
  top: "conv1_43"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_44"
  type: "Convolution"
  bottom: "data"
  top: "conv1_44"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_45"
  type: "Convolution"
  bottom: "data"
  top: "conv1_45"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_46"
  type: "Convolution"
  bottom: "data"
  top: "conv1_46"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_47"
  type: "Convolution"
  bottom: "data"
  top: "conv1_47"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_48"
  type: "Convolution"
  bottom: "data"
  top: "conv1_48"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_49"
  type: "Convolution"
  bottom: "data"
  top: "conv1_49"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_50"
  type: "Convolution"
  bottom: "data"
  top: "conv1_50"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_51"
  type: "Convolution"
  bottom: "data"
  top: "conv1_51"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_52"
  type: "Convolution"
  bottom: "data"
  top: "conv1_52"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_53"
  type: "Convolution"
  bottom: "data"
  top: "conv1_53"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_54"
  type: "Convolution"
  bottom: "data"
  top: "conv1_54"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_55"
  type: "Convolution"
  bottom: "data"
  top: "conv1_55"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_56"
  type: "Convolution"
  bottom: "data"
  top: "conv1_56"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_57"
  type: "Convolution"
  bottom: "data"
  top: "conv1_57"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_58"
  type: "Convolution"
  bottom: "data"
  top: "conv1_58"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_59"
  type: "Convolution"
  bottom: "data"
  top: "conv1_59"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_60"
  type: "Convolution"
  bottom: "data"
  top: "conv1_60"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_61"
  type: "Convolution"
  bottom: "data"
  top: "conv1_61"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_62"
  type: "Convolution"
  bottom: "data"
  top: "conv1_62"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_63"
  type: "Convolution"
  bottom: "data"
  top: "conv1_63"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_64"
  type: "Convolution"
  bottom: "data"
  top: "conv1_64"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat5"
  type: "Concat"
  bottom: "conv1_1"
  bottom: "conv1_2"
  bottom: "conv1_3"
  bottom: "conv1_4"
  bottom: "conv1_5"
  bottom: "conv1_6"
  bottom: "conv1_7"
  bottom: "conv1_8"
  bottom: "conv1_9"
  bottom: "conv1_10"
  bottom: "conv1_11"
  bottom: "conv1_12"
  bottom: "conv1_13"
  bottom: "conv1_14"
  bottom: "conv1_15"
  bottom: "conv1_16"
  bottom: "conv1_17"
  bottom: "conv1_18"
  bottom: "conv1_19"
  bottom: "conv1_20"
  bottom: "conv1_21"
  bottom: "conv1_22"
  bottom: "conv1_23"
  bottom: "conv1_24"
  bottom: "conv1_25"
  bottom: "conv1_26"
  bottom: "conv1_27"
  bottom: "conv1_28"
  bottom: "conv1_29"
  bottom: "conv1_30"
  bottom: "conv1_31"
  bottom: "conv1_32"
  bottom: "conv1_33"
  bottom: "conv1_34"
  bottom: "conv1_35"
  bottom: "conv1_36"
  bottom: "conv1_37"
  bottom: "conv1_38"
  bottom: "conv1_39"
  bottom: "conv1_40"
  bottom: "conv1_41"
  bottom: "conv1_42"
  bottom: "conv1_43"
  bottom: "conv1_44"
  bottom: "conv1_45"
  bottom: "conv1_46"
  bottom: "conv1_47"
  bottom: "conv1_48"
  bottom: "conv1_49"
  bottom: "conv1_50"
  bottom: "conv1_51"
  bottom: "conv1_52"
  bottom: "conv1_53"
  bottom: "conv1_54"
  bottom: "conv1_55"
  bottom: "conv1_56"
  bottom: "conv1_57"
  bottom: "conv1_58"
  bottom: "conv1_59"
  bottom: "conv1_60"
  bottom: "conv1_61"
  bottom: "conv1_62"
  bottom: "conv1_63"
  bottom: "conv1_64"
  top: "concat5"
  concat_param {
    axis: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "concat5"
  top: "concat5"
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_5"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_6"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_7"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_8"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_8"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_9"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_9"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_10"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_10"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_11"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_11"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_12"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_12"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_13"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_13"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_14"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_14"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_15"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_15"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_16"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_16"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_17"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_17"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_18"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_18"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_19"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_19"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_20"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_20"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_21"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_21"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_22"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_22"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_23"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_23"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_24"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_24"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_25"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_25"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_26"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_26"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_27"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_27"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_28"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_28"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_29"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_29"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_30"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_30"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_31"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_31"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_32"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_32"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_33"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_33"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_34"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_34"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_35"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_35"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_36"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_36"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_37"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_37"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_38"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_38"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_39"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_39"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_40"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_40"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_41"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_41"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_42"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_42"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_43"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_43"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_44"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_44"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_45"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_45"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_46"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_46"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_47"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_47"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_48"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_48"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_49"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_49"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_50"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_50"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_51"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_51"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_52"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_52"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_53"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_53"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_54"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_54"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_55"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_55"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_56"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_56"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_57"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_57"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_58"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_58"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_59"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_59"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_60"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_60"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_61"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_61"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_62"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_62"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_63"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_63"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_64"
  type: "Convolution"
  bottom: "concat5"
  top: "conv2_64"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat6"
  type: "Concat"
  bottom: "conv2_1"
  bottom: "conv2_2"
  bottom: "conv2_3"
  bottom: "conv2_4"
  bottom: "conv2_5"
  bottom: "conv2_6"
  bottom: "conv2_7"
  bottom: "conv2_8"
  bottom: "conv2_9"
  bottom: "conv2_10"
  bottom: "conv2_11"
  bottom: "conv2_12"
  bottom: "conv2_13"
  bottom: "conv2_14"
  bottom: "conv2_15"
  bottom: "conv2_16"
  bottom: "conv2_17"
  bottom: "conv2_18"
  bottom: "conv2_19"
  bottom: "conv2_20"
  bottom: "conv2_21"
  bottom: "conv2_22"
  bottom: "conv2_23"
  bottom: "conv2_24"
  bottom: "conv2_25"
  bottom: "conv2_26"
  bottom: "conv2_27"
  bottom: "conv2_28"
  bottom: "conv2_29"
  bottom: "conv2_30"
  bottom: "conv2_31"
  bottom: "conv2_32"
  bottom: "conv2_33"
  bottom: "conv2_34"
  bottom: "conv2_35"
  bottom: "conv2_36"
  bottom: "conv2_37"
  bottom: "conv2_38"
  bottom: "conv2_39"
  bottom: "conv2_40"
  bottom: "conv2_41"
  bottom: "conv2_42"
  bottom: "conv2_43"
  bottom: "conv2_44"
  bottom: "conv2_45"
  bottom: "conv2_46"
  bottom: "conv2_47"
  bottom: "conv2_48"
  bottom: "conv2_49"
  bottom: "conv2_50"
  bottom: "conv2_51"
  bottom: "conv2_52"
  bottom: "conv2_53"
  bottom: "conv2_54"
  bottom: "conv2_55"
  bottom: "conv2_56"
  bottom: "conv2_57"
  bottom: "conv2_58"
  bottom: "conv2_59"
  bottom: "conv2_60"
  bottom: "conv2_61"
  bottom: "conv2_62"
  bottom: "conv2_63"
  bottom: "conv2_64"
  top: "concat6"
  concat_param {
    axis: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "concat6"
  top: "concat6"
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "concat6"
  top: "conv3_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "concat6"
  top: "conv3_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 31
    kernel_h: 64
    kernel_w: 3
    stride: 1
    pad_h: 0
    pad_w: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "concat6"
  top: "conv3_3"
  param {
