name: "BinaryMask"
layer {
  name: "hdf5_train_data"
  type: "HDF5Data"
  top: "data"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "train/64/train.txt"
    batch_size: 32
    shuffle: 1
  }
}
layer {
  name: "hdf5_test_data"
  type: "HDF5Data"
  top: "data"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "test/test.txt"
    batch_size: 32
    shuffle: 1
  }
}
layer {
  name: "slice1"
  type: "Slice"
  bottom: "data"
  top: "slice1_1"
  top: "slice1_2"
  top: "slice1_3"
  top: "slice1_4"
  top: "slice1_5"
  top: "slice1_6"
  top: "slice1_7"
  top: "slice1_8"
  top: "slice1_9"
  top: "slice1_10"
  top: "slice1_11"
  top: "slice1_12"
  top: "slice1_13"
  top: "slice1_14"
  top: "slice1_15"
  top: "slice1_16"
  top: "slice1_17"
  top: "slice1_18"
  top: "slice1_19"
  top: "slice1_20"
  top: "slice1_21"
  top: "slice1_22"
  top: "slice1_23"
  top: "slice1_24"
  top: "slice1_25"
  top: "slice1_26"
  top: "slice1_27"
  top: "slice1_28"
  top: "slice1_29"
  top: "slice1_30"
  top: "slice1_31"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
  }
}
layer {
  name: "slice2_1"
  type: "Slice"
  bottom: "slice1_1"
  top: "slice2_1_1"
  top: "slice2_1_2"
  top: "slice2_1_3"
  top: "slice2_1_4"
  top: "slice2_1_5"
  top: "slice2_1_6"
  top: "slice2_1_7"
  top: "slice2_1_8"
  top: "slice2_1_9"
  top: "slice2_1_10"
  top: "slice2_1_11"
  top: "slice2_1_12"
  top: "slice2_1_13"
  top: "slice2_1_14"
  top: "slice2_1_15"
  top: "slice2_1_16"
  top: "slice2_1_17"
  top: "slice2_1_18"
  top: "slice2_1_19"
  top: "slice2_1_20"
  top: "slice2_1_21"
  top: "slice2_1_22"
  top: "slice2_1_23"
  top: "slice2_1_24"
  top: "slice2_1_25"
  top: "slice2_1_26"
  top: "slice2_1_27"
  top: "slice2_1_28"
  top: "slice2_1_29"
  top: "slice2_1_30"
  top: "slice2_1_31"
  top: "slice2_1_32"
  top: "slice2_1_33"
  top: "slice2_1_34"
  top: "slice2_1_35"
  top: "slice2_1_36"
  top: "slice2_1_37"
  top: "slice2_1_38"
  top: "slice2_1_39"
  top: "slice2_1_40"
  top: "slice2_1_41"
  top: "slice2_1_42"
  top: "slice2_1_43"
  top: "slice2_1_44"
  top: "slice2_1_45"
  top: "slice2_1_46"
  top: "slice2_1_47"
  top: "slice2_1_48"
  top: "slice2_1_49"
  top: "slice2_1_50"
  top: "slice2_1_51"
  top: "slice2_1_52"
  top: "slice2_1_53"
  top: "slice2_1_54"
  top: "slice2_1_55"
  top: "slice2_1_56"
  top: "slice2_1_57"
  top: "slice2_1_58"
  top: "slice2_1_59"
  top: "slice2_1_60"
  top: "slice2_1_61"
  top: "slice2_1_62"
  top: "slice2_1_63"
  top: "slice2_1_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_2"
  type: "Slice"
  bottom: "slice1_2"
  top: "slice2_2_1"
  top: "slice2_2_2"
  top: "slice2_2_3"
  top: "slice2_2_4"
  top: "slice2_2_5"
  top: "slice2_2_6"
  top: "slice2_2_7"
  top: "slice2_2_8"
  top: "slice2_2_9"
  top: "slice2_2_10"
  top: "slice2_2_11"
  top: "slice2_2_12"
  top: "slice2_2_13"
  top: "slice2_2_14"
  top: "slice2_2_15"
  top: "slice2_2_16"
  top: "slice2_2_17"
  top: "slice2_2_18"
  top: "slice2_2_19"
  top: "slice2_2_20"
  top: "slice2_2_21"
  top: "slice2_2_22"
  top: "slice2_2_23"
  top: "slice2_2_24"
  top: "slice2_2_25"
  top: "slice2_2_26"
  top: "slice2_2_27"
  top: "slice2_2_28"
  top: "slice2_2_29"
  top: "slice2_2_30"
  top: "slice2_2_31"
  top: "slice2_2_32"
  top: "slice2_2_33"
  top: "slice2_2_34"
  top: "slice2_2_35"
  top: "slice2_2_36"
  top: "slice2_2_37"
  top: "slice2_2_38"
  top: "slice2_2_39"
  top: "slice2_2_40"
  top: "slice2_2_41"
  top: "slice2_2_42"
  top: "slice2_2_43"
  top: "slice2_2_44"
  top: "slice2_2_45"
  top: "slice2_2_46"
  top: "slice2_2_47"
  top: "slice2_2_48"
  top: "slice2_2_49"
  top: "slice2_2_50"
  top: "slice2_2_51"
  top: "slice2_2_52"
  top: "slice2_2_53"
  top: "slice2_2_54"
  top: "slice2_2_55"
  top: "slice2_2_56"
  top: "slice2_2_57"
  top: "slice2_2_58"
  top: "slice2_2_59"
  top: "slice2_2_60"
  top: "slice2_2_61"
  top: "slice2_2_62"
  top: "slice2_2_63"
  top: "slice2_2_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_3"
  type: "Slice"
  bottom: "slice1_3"
  top: "slice2_3_1"
  top: "slice2_3_2"
  top: "slice2_3_3"
  top: "slice2_3_4"
  top: "slice2_3_5"
  top: "slice2_3_6"
  top: "slice2_3_7"
  top: "slice2_3_8"
  top: "slice2_3_9"
  top: "slice2_3_10"
  top: "slice2_3_11"
  top: "slice2_3_12"
  top: "slice2_3_13"
  top: "slice2_3_14"
  top: "slice2_3_15"
  top: "slice2_3_16"
  top: "slice2_3_17"
  top: "slice2_3_18"
  top: "slice2_3_19"
  top: "slice2_3_20"
  top: "slice2_3_21"
  top: "slice2_3_22"
  top: "slice2_3_23"
  top: "slice2_3_24"
  top: "slice2_3_25"
  top: "slice2_3_26"
  top: "slice2_3_27"
  top: "slice2_3_28"
  top: "slice2_3_29"
  top: "slice2_3_30"
  top: "slice2_3_31"
  top: "slice2_3_32"
  top: "slice2_3_33"
  top: "slice2_3_34"
  top: "slice2_3_35"
  top: "slice2_3_36"
  top: "slice2_3_37"
  top: "slice2_3_38"
  top: "slice2_3_39"
  top: "slice2_3_40"
  top: "slice2_3_41"
  top: "slice2_3_42"
  top: "slice2_3_43"
  top: "slice2_3_44"
  top: "slice2_3_45"
  top: "slice2_3_46"
  top: "slice2_3_47"
  top: "slice2_3_48"
  top: "slice2_3_49"
  top: "slice2_3_50"
  top: "slice2_3_51"
  top: "slice2_3_52"
  top: "slice2_3_53"
  top: "slice2_3_54"
  top: "slice2_3_55"
  top: "slice2_3_56"
  top: "slice2_3_57"
  top: "slice2_3_58"
  top: "slice2_3_59"
  top: "slice2_3_60"
  top: "slice2_3_61"
  top: "slice2_3_62"
  top: "slice2_3_63"
  top: "slice2_3_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_4"
  type: "Slice"
  bottom: "slice1_4"
  top: "slice2_4_1"
  top: "slice2_4_2"
  top: "slice2_4_3"
  top: "slice2_4_4"
  top: "slice2_4_5"
  top: "slice2_4_6"
  top: "slice2_4_7"
  top: "slice2_4_8"
  top: "slice2_4_9"
  top: "slice2_4_10"
  top: "slice2_4_11"
  top: "slice2_4_12"
  top: "slice2_4_13"
  top: "slice2_4_14"
  top: "slice2_4_15"
  top: "slice2_4_16"
  top: "slice2_4_17"
  top: "slice2_4_18"
  top: "slice2_4_19"
  top: "slice2_4_20"
  top: "slice2_4_21"
  top: "slice2_4_22"
  top: "slice2_4_23"
  top: "slice2_4_24"
  top: "slice2_4_25"
  top: "slice2_4_26"
  top: "slice2_4_27"
  top: "slice2_4_28"
  top: "slice2_4_29"
  top: "slice2_4_30"
  top: "slice2_4_31"
  top: "slice2_4_32"
  top: "slice2_4_33"
  top: "slice2_4_34"
  top: "slice2_4_35"
  top: "slice2_4_36"
  top: "slice2_4_37"
  top: "slice2_4_38"
  top: "slice2_4_39"
  top: "slice2_4_40"
  top: "slice2_4_41"
  top: "slice2_4_42"
  top: "slice2_4_43"
  top: "slice2_4_44"
  top: "slice2_4_45"
  top: "slice2_4_46"
  top: "slice2_4_47"
  top: "slice2_4_48"
  top: "slice2_4_49"
  top: "slice2_4_50"
  top: "slice2_4_51"
  top: "slice2_4_52"
  top: "slice2_4_53"
  top: "slice2_4_54"
  top: "slice2_4_55"
  top: "slice2_4_56"
  top: "slice2_4_57"
  top: "slice2_4_58"
  top: "slice2_4_59"
  top: "slice2_4_60"
  top: "slice2_4_61"
  top: "slice2_4_62"
  top: "slice2_4_63"
  top: "slice2_4_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_5"
  type: "Slice"
  bottom: "slice1_5"
  top: "slice2_5_1"
  top: "slice2_5_2"
  top: "slice2_5_3"
  top: "slice2_5_4"
  top: "slice2_5_5"
  top: "slice2_5_6"
  top: "slice2_5_7"
  top: "slice2_5_8"
  top: "slice2_5_9"
  top: "slice2_5_10"
  top: "slice2_5_11"
  top: "slice2_5_12"
  top: "slice2_5_13"
  top: "slice2_5_14"
  top: "slice2_5_15"
  top: "slice2_5_16"
  top: "slice2_5_17"
  top: "slice2_5_18"
  top: "slice2_5_19"
  top: "slice2_5_20"
  top: "slice2_5_21"
  top: "slice2_5_22"
  top: "slice2_5_23"
  top: "slice2_5_24"
  top: "slice2_5_25"
  top: "slice2_5_26"
  top: "slice2_5_27"
  top: "slice2_5_28"
  top: "slice2_5_29"
  top: "slice2_5_30"
  top: "slice2_5_31"
  top: "slice2_5_32"
  top: "slice2_5_33"
  top: "slice2_5_34"
  top: "slice2_5_35"
  top: "slice2_5_36"
  top: "slice2_5_37"
  top: "slice2_5_38"
  top: "slice2_5_39"
  top: "slice2_5_40"
  top: "slice2_5_41"
  top: "slice2_5_42"
  top: "slice2_5_43"
  top: "slice2_5_44"
  top: "slice2_5_45"
  top: "slice2_5_46"
  top: "slice2_5_47"
  top: "slice2_5_48"
  top: "slice2_5_49"
  top: "slice2_5_50"
  top: "slice2_5_51"
  top: "slice2_5_52"
  top: "slice2_5_53"
  top: "slice2_5_54"
  top: "slice2_5_55"
  top: "slice2_5_56"
  top: "slice2_5_57"
  top: "slice2_5_58"
  top: "slice2_5_59"
  top: "slice2_5_60"
  top: "slice2_5_61"
  top: "slice2_5_62"
  top: "slice2_5_63"
  top: "slice2_5_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_6"
  type: "Slice"
  bottom: "slice1_6"
  top: "slice2_6_1"
  top: "slice2_6_2"
  top: "slice2_6_3"
  top: "slice2_6_4"
  top: "slice2_6_5"
  top: "slice2_6_6"
  top: "slice2_6_7"
  top: "slice2_6_8"
  top: "slice2_6_9"
  top: "slice2_6_10"
  top: "slice2_6_11"
  top: "slice2_6_12"
  top: "slice2_6_13"
  top: "slice2_6_14"
  top: "slice2_6_15"
  top: "slice2_6_16"
  top: "slice2_6_17"
  top: "slice2_6_18"
  top: "slice2_6_19"
  top: "slice2_6_20"
  top: "slice2_6_21"
  top: "slice2_6_22"
  top: "slice2_6_23"
  top: "slice2_6_24"
  top: "slice2_6_25"
  top: "slice2_6_26"
  top: "slice2_6_27"
  top: "slice2_6_28"
  top: "slice2_6_29"
  top: "slice2_6_30"
  top: "slice2_6_31"
  top: "slice2_6_32"
  top: "slice2_6_33"
  top: "slice2_6_34"
  top: "slice2_6_35"
  top: "slice2_6_36"
  top: "slice2_6_37"
  top: "slice2_6_38"
  top: "slice2_6_39"
  top: "slice2_6_40"
  top: "slice2_6_41"
  top: "slice2_6_42"
  top: "slice2_6_43"
  top: "slice2_6_44"
  top: "slice2_6_45"
  top: "slice2_6_46"
  top: "slice2_6_47"
  top: "slice2_6_48"
  top: "slice2_6_49"
  top: "slice2_6_50"
  top: "slice2_6_51"
  top: "slice2_6_52"
  top: "slice2_6_53"
  top: "slice2_6_54"
  top: "slice2_6_55"
  top: "slice2_6_56"
  top: "slice2_6_57"
  top: "slice2_6_58"
  top: "slice2_6_59"
  top: "slice2_6_60"
  top: "slice2_6_61"
  top: "slice2_6_62"
  top: "slice2_6_63"
  top: "slice2_6_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_7"
  type: "Slice"
  bottom: "slice1_7"
  top: "slice2_7_1"
  top: "slice2_7_2"
  top: "slice2_7_3"
  top: "slice2_7_4"
  top: "slice2_7_5"
  top: "slice2_7_6"
  top: "slice2_7_7"
  top: "slice2_7_8"
  top: "slice2_7_9"
  top: "slice2_7_10"
  top: "slice2_7_11"
  top: "slice2_7_12"
  top: "slice2_7_13"
  top: "slice2_7_14"
  top: "slice2_7_15"
  top: "slice2_7_16"
  top: "slice2_7_17"
  top: "slice2_7_18"
  top: "slice2_7_19"
  top: "slice2_7_20"
  top: "slice2_7_21"
  top: "slice2_7_22"
  top: "slice2_7_23"
  top: "slice2_7_24"
  top: "slice2_7_25"
  top: "slice2_7_26"
  top: "slice2_7_27"
  top: "slice2_7_28"
  top: "slice2_7_29"
  top: "slice2_7_30"
  top: "slice2_7_31"
  top: "slice2_7_32"
  top: "slice2_7_33"
  top: "slice2_7_34"
  top: "slice2_7_35"
  top: "slice2_7_36"
  top: "slice2_7_37"
  top: "slice2_7_38"
  top: "slice2_7_39"
  top: "slice2_7_40"
  top: "slice2_7_41"
  top: "slice2_7_42"
  top: "slice2_7_43"
  top: "slice2_7_44"
  top: "slice2_7_45"
  top: "slice2_7_46"
  top: "slice2_7_47"
  top: "slice2_7_48"
  top: "slice2_7_49"
  top: "slice2_7_50"
  top: "slice2_7_51"
  top: "slice2_7_52"
  top: "slice2_7_53"
  top: "slice2_7_54"
  top: "slice2_7_55"
  top: "slice2_7_56"
  top: "slice2_7_57"
  top: "slice2_7_58"
  top: "slice2_7_59"
  top: "slice2_7_60"
  top: "slice2_7_61"
  top: "slice2_7_62"
  top: "slice2_7_63"
  top: "slice2_7_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_8"
  type: "Slice"
  bottom: "slice1_8"
  top: "slice2_8_1"
  top: "slice2_8_2"
  top: "slice2_8_3"
  top: "slice2_8_4"
  top: "slice2_8_5"
  top: "slice2_8_6"
  top: "slice2_8_7"
  top: "slice2_8_8"
  top: "slice2_8_9"
  top: "slice2_8_10"
  top: "slice2_8_11"
  top: "slice2_8_12"
  top: "slice2_8_13"
  top: "slice2_8_14"
  top: "slice2_8_15"
  top: "slice2_8_16"
  top: "slice2_8_17"
  top: "slice2_8_18"
  top: "slice2_8_19"
  top: "slice2_8_20"
  top: "slice2_8_21"
  top: "slice2_8_22"
  top: "slice2_8_23"
  top: "slice2_8_24"
  top: "slice2_8_25"
  top: "slice2_8_26"
  top: "slice2_8_27"
  top: "slice2_8_28"
  top: "slice2_8_29"
  top: "slice2_8_30"
  top: "slice2_8_31"
  top: "slice2_8_32"
  top: "slice2_8_33"
  top: "slice2_8_34"
  top: "slice2_8_35"
  top: "slice2_8_36"
  top: "slice2_8_37"
  top: "slice2_8_38"
  top: "slice2_8_39"
  top: "slice2_8_40"
  top: "slice2_8_41"
  top: "slice2_8_42"
  top: "slice2_8_43"
  top: "slice2_8_44"
  top: "slice2_8_45"
  top: "slice2_8_46"
  top: "slice2_8_47"
  top: "slice2_8_48"
  top: "slice2_8_49"
  top: "slice2_8_50"
  top: "slice2_8_51"
  top: "slice2_8_52"
  top: "slice2_8_53"
  top: "slice2_8_54"
  top: "slice2_8_55"
  top: "slice2_8_56"
  top: "slice2_8_57"
  top: "slice2_8_58"
  top: "slice2_8_59"
  top: "slice2_8_60"
  top: "slice2_8_61"
  top: "slice2_8_62"
  top: "slice2_8_63"
  top: "slice2_8_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_9"
  type: "Slice"
  bottom: "slice1_9"
  top: "slice2_9_1"
  top: "slice2_9_2"
  top: "slice2_9_3"
  top: "slice2_9_4"
  top: "slice2_9_5"
  top: "slice2_9_6"
  top: "slice2_9_7"
  top: "slice2_9_8"
  top: "slice2_9_9"
  top: "slice2_9_10"
  top: "slice2_9_11"
  top: "slice2_9_12"
  top: "slice2_9_13"
  top: "slice2_9_14"
  top: "slice2_9_15"
  top: "slice2_9_16"
  top: "slice2_9_17"
  top: "slice2_9_18"
  top: "slice2_9_19"
  top: "slice2_9_20"
  top: "slice2_9_21"
  top: "slice2_9_22"
  top: "slice2_9_23"
  top: "slice2_9_24"
  top: "slice2_9_25"
  top: "slice2_9_26"
  top: "slice2_9_27"
  top: "slice2_9_28"
  top: "slice2_9_29"
  top: "slice2_9_30"
  top: "slice2_9_31"
  top: "slice2_9_32"
  top: "slice2_9_33"
  top: "slice2_9_34"
  top: "slice2_9_35"
  top: "slice2_9_36"
  top: "slice2_9_37"
  top: "slice2_9_38"
  top: "slice2_9_39"
  top: "slice2_9_40"
  top: "slice2_9_41"
  top: "slice2_9_42"
  top: "slice2_9_43"
  top: "slice2_9_44"
  top: "slice2_9_45"
  top: "slice2_9_46"
  top: "slice2_9_47"
  top: "slice2_9_48"
  top: "slice2_9_49"
  top: "slice2_9_50"
  top: "slice2_9_51"
  top: "slice2_9_52"
  top: "slice2_9_53"
  top: "slice2_9_54"
  top: "slice2_9_55"
  top: "slice2_9_56"
  top: "slice2_9_57"
  top: "slice2_9_58"
  top: "slice2_9_59"
  top: "slice2_9_60"
  top: "slice2_9_61"
  top: "slice2_9_62"
  top: "slice2_9_63"
  top: "slice2_9_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_10"
  type: "Slice"
  bottom: "slice1_10"
  top: "slice2_10_1"
  top: "slice2_10_2"
  top: "slice2_10_3"
  top: "slice2_10_4"
  top: "slice2_10_5"
  top: "slice2_10_6"
  top: "slice2_10_7"
  top: "slice2_10_8"
  top: "slice2_10_9"
  top: "slice2_10_10"
  top: "slice2_10_11"
  top: "slice2_10_12"
  top: "slice2_10_13"
  top: "slice2_10_14"
  top: "slice2_10_15"
  top: "slice2_10_16"
  top: "slice2_10_17"
  top: "slice2_10_18"
  top: "slice2_10_19"
  top: "slice2_10_20"
  top: "slice2_10_21"
  top: "slice2_10_22"
  top: "slice2_10_23"
  top: "slice2_10_24"
  top: "slice2_10_25"
  top: "slice2_10_26"
  top: "slice2_10_27"
  top: "slice2_10_28"
  top: "slice2_10_29"
  top: "slice2_10_30"
  top: "slice2_10_31"
  top: "slice2_10_32"
  top: "slice2_10_33"
  top: "slice2_10_34"
  top: "slice2_10_35"
  top: "slice2_10_36"
  top: "slice2_10_37"
  top: "slice2_10_38"
  top: "slice2_10_39"
  top: "slice2_10_40"
  top: "slice2_10_41"
  top: "slice2_10_42"
  top: "slice2_10_43"
  top: "slice2_10_44"
  top: "slice2_10_45"
  top: "slice2_10_46"
  top: "slice2_10_47"
  top: "slice2_10_48"
  top: "slice2_10_49"
  top: "slice2_10_50"
  top: "slice2_10_51"
  top: "slice2_10_52"
  top: "slice2_10_53"
  top: "slice2_10_54"
  top: "slice2_10_55"
  top: "slice2_10_56"
  top: "slice2_10_57"
  top: "slice2_10_58"
  top: "slice2_10_59"
  top: "slice2_10_60"
  top: "slice2_10_61"
  top: "slice2_10_62"
  top: "slice2_10_63"
  top: "slice2_10_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_11"
  type: "Slice"
  bottom: "slice1_11"
  top: "slice2_11_1"
  top: "slice2_11_2"
  top: "slice2_11_3"
  top: "slice2_11_4"
  top: "slice2_11_5"
  top: "slice2_11_6"
  top: "slice2_11_7"
  top: "slice2_11_8"
  top: "slice2_11_9"
  top: "slice2_11_10"
  top: "slice2_11_11"
  top: "slice2_11_12"
  top: "slice2_11_13"
  top: "slice2_11_14"
  top: "slice2_11_15"
  top: "slice2_11_16"
  top: "slice2_11_17"
  top: "slice2_11_18"
  top: "slice2_11_19"
  top: "slice2_11_20"
  top: "slice2_11_21"
  top: "slice2_11_22"
  top: "slice2_11_23"
  top: "slice2_11_24"
  top: "slice2_11_25"
  top: "slice2_11_26"
  top: "slice2_11_27"
  top: "slice2_11_28"
  top: "slice2_11_29"
  top: "slice2_11_30"
  top: "slice2_11_31"
  top: "slice2_11_32"
  top: "slice2_11_33"
  top: "slice2_11_34"
  top: "slice2_11_35"
  top: "slice2_11_36"
  top: "slice2_11_37"
  top: "slice2_11_38"
  top: "slice2_11_39"
  top: "slice2_11_40"
  top: "slice2_11_41"
  top: "slice2_11_42"
  top: "slice2_11_43"
  top: "slice2_11_44"
  top: "slice2_11_45"
  top: "slice2_11_46"
  top: "slice2_11_47"
  top: "slice2_11_48"
  top: "slice2_11_49"
  top: "slice2_11_50"
  top: "slice2_11_51"
  top: "slice2_11_52"
  top: "slice2_11_53"
  top: "slice2_11_54"
  top: "slice2_11_55"
  top: "slice2_11_56"
  top: "slice2_11_57"
  top: "slice2_11_58"
  top: "slice2_11_59"
  top: "slice2_11_60"
  top: "slice2_11_61"
  top: "slice2_11_62"
  top: "slice2_11_63"
  top: "slice2_11_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_12"
  type: "Slice"
  bottom: "slice1_12"
  top: "slice2_12_1"
  top: "slice2_12_2"
  top: "slice2_12_3"
  top: "slice2_12_4"
  top: "slice2_12_5"
  top: "slice2_12_6"
  top: "slice2_12_7"
  top: "slice2_12_8"
  top: "slice2_12_9"
  top: "slice2_12_10"
  top: "slice2_12_11"
  top: "slice2_12_12"
  top: "slice2_12_13"
  top: "slice2_12_14"
  top: "slice2_12_15"
  top: "slice2_12_16"
  top: "slice2_12_17"
  top: "slice2_12_18"
  top: "slice2_12_19"
  top: "slice2_12_20"
  top: "slice2_12_21"
  top: "slice2_12_22"
  top: "slice2_12_23"
  top: "slice2_12_24"
  top: "slice2_12_25"
  top: "slice2_12_26"
  top: "slice2_12_27"
  top: "slice2_12_28"
  top: "slice2_12_29"
  top: "slice2_12_30"
  top: "slice2_12_31"
  top: "slice2_12_32"
  top: "slice2_12_33"
  top: "slice2_12_34"
  top: "slice2_12_35"
  top: "slice2_12_36"
  top: "slice2_12_37"
  top: "slice2_12_38"
  top: "slice2_12_39"
  top: "slice2_12_40"
  top: "slice2_12_41"
  top: "slice2_12_42"
  top: "slice2_12_43"
  top: "slice2_12_44"
  top: "slice2_12_45"
  top: "slice2_12_46"
  top: "slice2_12_47"
  top: "slice2_12_48"
  top: "slice2_12_49"
  top: "slice2_12_50"
  top: "slice2_12_51"
  top: "slice2_12_52"
  top: "slice2_12_53"
  top: "slice2_12_54"
  top: "slice2_12_55"
  top: "slice2_12_56"
  top: "slice2_12_57"
  top: "slice2_12_58"
  top: "slice2_12_59"
  top: "slice2_12_60"
  top: "slice2_12_61"
  top: "slice2_12_62"
  top: "slice2_12_63"
  top: "slice2_12_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_13"
  type: "Slice"
  bottom: "slice1_13"
  top: "slice2_13_1"
  top: "slice2_13_2"
  top: "slice2_13_3"
  top: "slice2_13_4"
  top: "slice2_13_5"
  top: "slice2_13_6"
  top: "slice2_13_7"
  top: "slice2_13_8"
  top: "slice2_13_9"
  top: "slice2_13_10"
  top: "slice2_13_11"
  top: "slice2_13_12"
  top: "slice2_13_13"
  top: "slice2_13_14"
  top: "slice2_13_15"
  top: "slice2_13_16"
  top: "slice2_13_17"
  top: "slice2_13_18"
  top: "slice2_13_19"
  top: "slice2_13_20"
  top: "slice2_13_21"
  top: "slice2_13_22"
  top: "slice2_13_23"
  top: "slice2_13_24"
  top: "slice2_13_25"
  top: "slice2_13_26"
  top: "slice2_13_27"
  top: "slice2_13_28"
  top: "slice2_13_29"
  top: "slice2_13_30"
  top: "slice2_13_31"
  top: "slice2_13_32"
  top: "slice2_13_33"
  top: "slice2_13_34"
  top: "slice2_13_35"
  top: "slice2_13_36"
  top: "slice2_13_37"
  top: "slice2_13_38"
  top: "slice2_13_39"
  top: "slice2_13_40"
  top: "slice2_13_41"
  top: "slice2_13_42"
  top: "slice2_13_43"
  top: "slice2_13_44"
  top: "slice2_13_45"
  top: "slice2_13_46"
  top: "slice2_13_47"
  top: "slice2_13_48"
  top: "slice2_13_49"
  top: "slice2_13_50"
  top: "slice2_13_51"
  top: "slice2_13_52"
  top: "slice2_13_53"
  top: "slice2_13_54"
  top: "slice2_13_55"
  top: "slice2_13_56"
  top: "slice2_13_57"
  top: "slice2_13_58"
  top: "slice2_13_59"
  top: "slice2_13_60"
  top: "slice2_13_61"
  top: "slice2_13_62"
  top: "slice2_13_63"
  top: "slice2_13_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_14"
  type: "Slice"
  bottom: "slice1_14"
  top: "slice2_14_1"
  top: "slice2_14_2"
  top: "slice2_14_3"
  top: "slice2_14_4"
  top: "slice2_14_5"
  top: "slice2_14_6"
  top: "slice2_14_7"
  top: "slice2_14_8"
  top: "slice2_14_9"
  top: "slice2_14_10"
  top: "slice2_14_11"
  top: "slice2_14_12"
  top: "slice2_14_13"
  top: "slice2_14_14"
  top: "slice2_14_15"
  top: "slice2_14_16"
  top: "slice2_14_17"
  top: "slice2_14_18"
  top: "slice2_14_19"
  top: "slice2_14_20"
  top: "slice2_14_21"
  top: "slice2_14_22"
  top: "slice2_14_23"
  top: "slice2_14_24"
  top: "slice2_14_25"
  top: "slice2_14_26"
  top: "slice2_14_27"
  top: "slice2_14_28"
  top: "slice2_14_29"
  top: "slice2_14_30"
  top: "slice2_14_31"
  top: "slice2_14_32"
  top: "slice2_14_33"
  top: "slice2_14_34"
  top: "slice2_14_35"
  top: "slice2_14_36"
  top: "slice2_14_37"
  top: "slice2_14_38"
  top: "slice2_14_39"
  top: "slice2_14_40"
  top: "slice2_14_41"
  top: "slice2_14_42"
  top: "slice2_14_43"
  top: "slice2_14_44"
  top: "slice2_14_45"
  top: "slice2_14_46"
  top: "slice2_14_47"
  top: "slice2_14_48"
  top: "slice2_14_49"
  top: "slice2_14_50"
  top: "slice2_14_51"
  top: "slice2_14_52"
  top: "slice2_14_53"
  top: "slice2_14_54"
  top: "slice2_14_55"
  top: "slice2_14_56"
  top: "slice2_14_57"
  top: "slice2_14_58"
  top: "slice2_14_59"
  top: "slice2_14_60"
  top: "slice2_14_61"
  top: "slice2_14_62"
  top: "slice2_14_63"
  top: "slice2_14_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_15"
  type: "Slice"
  bottom: "slice1_15"
  top: "slice2_15_1"
  top: "slice2_15_2"
  top: "slice2_15_3"
  top: "slice2_15_4"
  top: "slice2_15_5"
  top: "slice2_15_6"
  top: "slice2_15_7"
  top: "slice2_15_8"
  top: "slice2_15_9"
  top: "slice2_15_10"
  top: "slice2_15_11"
  top: "slice2_15_12"
  top: "slice2_15_13"
  top: "slice2_15_14"
  top: "slice2_15_15"
  top: "slice2_15_16"
  top: "slice2_15_17"
  top: "slice2_15_18"
  top: "slice2_15_19"
  top: "slice2_15_20"
  top: "slice2_15_21"
  top: "slice2_15_22"
  top: "slice2_15_23"
  top: "slice2_15_24"
  top: "slice2_15_25"
  top: "slice2_15_26"
  top: "slice2_15_27"
  top: "slice2_15_28"
  top: "slice2_15_29"
  top: "slice2_15_30"
  top: "slice2_15_31"
  top: "slice2_15_32"
  top: "slice2_15_33"
  top: "slice2_15_34"
  top: "slice2_15_35"
  top: "slice2_15_36"
  top: "slice2_15_37"
  top: "slice2_15_38"
  top: "slice2_15_39"
  top: "slice2_15_40"
  top: "slice2_15_41"
  top: "slice2_15_42"
  top: "slice2_15_43"
  top: "slice2_15_44"
  top: "slice2_15_45"
  top: "slice2_15_46"
  top: "slice2_15_47"
  top: "slice2_15_48"
  top: "slice2_15_49"
  top: "slice2_15_50"
  top: "slice2_15_51"
  top: "slice2_15_52"
  top: "slice2_15_53"
  top: "slice2_15_54"
  top: "slice2_15_55"
  top: "slice2_15_56"
  top: "slice2_15_57"
  top: "slice2_15_58"
  top: "slice2_15_59"
  top: "slice2_15_60"
  top: "slice2_15_61"
  top: "slice2_15_62"
  top: "slice2_15_63"
  top: "slice2_15_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_16"
  type: "Slice"
  bottom: "slice1_16"
  top: "slice2_16_1"
  top: "slice2_16_2"
  top: "slice2_16_3"
  top: "slice2_16_4"
  top: "slice2_16_5"
  top: "slice2_16_6"
  top: "slice2_16_7"
  top: "slice2_16_8"
  top: "slice2_16_9"
  top: "slice2_16_10"
  top: "slice2_16_11"
  top: "slice2_16_12"
  top: "slice2_16_13"
  top: "slice2_16_14"
  top: "slice2_16_15"
  top: "slice2_16_16"
  top: "slice2_16_17"
  top: "slice2_16_18"
  top: "slice2_16_19"
  top: "slice2_16_20"
  top: "slice2_16_21"
  top: "slice2_16_22"
  top: "slice2_16_23"
  top: "slice2_16_24"
  top: "slice2_16_25"
  top: "slice2_16_26"
  top: "slice2_16_27"
  top: "slice2_16_28"
  top: "slice2_16_29"
  top: "slice2_16_30"
  top: "slice2_16_31"
  top: "slice2_16_32"
  top: "slice2_16_33"
  top: "slice2_16_34"
  top: "slice2_16_35"
  top: "slice2_16_36"
  top: "slice2_16_37"
  top: "slice2_16_38"
  top: "slice2_16_39"
  top: "slice2_16_40"
  top: "slice2_16_41"
  top: "slice2_16_42"
  top: "slice2_16_43"
  top: "slice2_16_44"
  top: "slice2_16_45"
  top: "slice2_16_46"
  top: "slice2_16_47"
  top: "slice2_16_48"
  top: "slice2_16_49"
  top: "slice2_16_50"
  top: "slice2_16_51"
  top: "slice2_16_52"
  top: "slice2_16_53"
  top: "slice2_16_54"
  top: "slice2_16_55"
  top: "slice2_16_56"
  top: "slice2_16_57"
  top: "slice2_16_58"
  top: "slice2_16_59"
  top: "slice2_16_60"
  top: "slice2_16_61"
  top: "slice2_16_62"
  top: "slice2_16_63"
  top: "slice2_16_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_17"
  type: "Slice"
  bottom: "slice1_17"
  top: "slice2_17_1"
  top: "slice2_17_2"
  top: "slice2_17_3"
  top: "slice2_17_4"
  top: "slice2_17_5"
  top: "slice2_17_6"
  top: "slice2_17_7"
  top: "slice2_17_8"
  top: "slice2_17_9"
  top: "slice2_17_10"
  top: "slice2_17_11"
  top: "slice2_17_12"
  top: "slice2_17_13"
  top: "slice2_17_14"
  top: "slice2_17_15"
  top: "slice2_17_16"
  top: "slice2_17_17"
  top: "slice2_17_18"
  top: "slice2_17_19"
  top: "slice2_17_20"
  top: "slice2_17_21"
  top: "slice2_17_22"
  top: "slice2_17_23"
  top: "slice2_17_24"
  top: "slice2_17_25"
  top: "slice2_17_26"
  top: "slice2_17_27"
  top: "slice2_17_28"
  top: "slice2_17_29"
  top: "slice2_17_30"
  top: "slice2_17_31"
  top: "slice2_17_32"
  top: "slice2_17_33"
  top: "slice2_17_34"
  top: "slice2_17_35"
  top: "slice2_17_36"
  top: "slice2_17_37"
  top: "slice2_17_38"
  top: "slice2_17_39"
  top: "slice2_17_40"
  top: "slice2_17_41"
  top: "slice2_17_42"
  top: "slice2_17_43"
  top: "slice2_17_44"
  top: "slice2_17_45"
  top: "slice2_17_46"
  top: "slice2_17_47"
  top: "slice2_17_48"
  top: "slice2_17_49"
  top: "slice2_17_50"
  top: "slice2_17_51"
  top: "slice2_17_52"
  top: "slice2_17_53"
  top: "slice2_17_54"
  top: "slice2_17_55"
  top: "slice2_17_56"
  top: "slice2_17_57"
  top: "slice2_17_58"
  top: "slice2_17_59"
  top: "slice2_17_60"
  top: "slice2_17_61"
  top: "slice2_17_62"
  top: "slice2_17_63"
  top: "slice2_17_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
    slice_point: 35
    slice_point: 36
    slice_point: 37
    slice_point: 38
    slice_point: 39
    slice_point: 40
    slice_point: 41
    slice_point: 42
    slice_point: 43
    slice_point: 44
    slice_point: 45
    slice_point: 46
    slice_point: 47
    slice_point: 48
    slice_point: 49
    slice_point: 50
    slice_point: 51
    slice_point: 52
    slice_point: 53
    slice_point: 54
    slice_point: 55
    slice_point: 56
    slice_point: 57
    slice_point: 58
    slice_point: 59
    slice_point: 60
    slice_point: 61
    slice_point: 62
    slice_point: 63
  }
}
layer {
  name: "slice2_18"
  type: "Slice"
  bottom: "slice1_18"
  top: "slice2_18_1"
  top: "slice2_18_2"
  top: "slice2_18_3"
  top: "slice2_18_4"
  top: "slice2_18_5"
  top: "slice2_18_6"
  top: "slice2_18_7"
  top: "slice2_18_8"
  top: "slice2_18_9"
  top: "slice2_18_10"
  top: "slice2_18_11"
  top: "slice2_18_12"
  top: "slice2_18_13"
  top: "slice2_18_14"
  top: "slice2_18_15"
  top: "slice2_18_16"
  top: "slice2_18_17"
  top: "slice2_18_18"
  top: "slice2_18_19"
  top: "slice2_18_20"
  top: "slice2_18_21"
  top: "slice2_18_22"
  top: "slice2_18_23"
  top: "slice2_18_24"
  top: "slice2_18_25"
  top: "slice2_18_26"
  top: "slice2_18_27"
  top: "slice2_18_28"
  top: "slice2_18_29"
  top: "slice2_18_30"
  top: "slice2_18_31"
  top: "slice2_18_32"
  top: "slice2_18_33"
  top: "slice2_18_34"
  top: "slice2_18_35"
  top: "slice2_18_36"
  top: "slice2_18_37"
  top: "slice2_18_38"
  top: "slice2_18_39"
  top: "slice2_18_40"
  top: "slice2_18_41"
  top: "slice2_18_42"
  top: "slice2_18_43"
  top: "slice2_18_44"
  top: "slice2_18_45"
  top: "slice2_18_46"
  top: "slice2_18_47"
  top: "slice2_18_48"
  top: "slice2_18_49"
  top: "slice2_18_50"
  top: "slice2_18_51"
  top: "slice2_18_52"
  top: "slice2_18_53"
  top: "slice2_18_54"
  top: "slice2_18_55"
  top: "slice2_18_56"
  top: "slice2_18_57"
  top: "slice2_18_58"
  top: "slice2_18_59"
  top: "slice2_18_60"
  top: "slice2_18_61"
  top: "slice2_18_62"
  top: "slice2_18_63"
  top: "slice2_18_64"
  slice_param {
    axis: 2
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20
    slice_point: 21
    slice_point: 22
    slice_point: 23
    slice_point: 24
    slice_point: 25
    slice_point: 26
    slice_point: 27
    slice_point: 28
    slice_point: 29
    slice_point: 30
    slice_point: 31
    slice_point: 32
    slice_point: 33
    slice_point: 34
